---
kind: property
id: P:Autodesk.Revit.DB.Mesh.Triangle(System.Int32)
source: html/35abd642-cf15-8281-e45d-083fb5c53d2a.htm
---
# Autodesk.Revit.DB.Mesh.Triangle Property

Retrieves a specific triangle.

## Syntax (C#)
```csharp
public MeshTriangle this[
	int idx
] { get; }
```

## Parameters
- **idx** (`System.Int32`) - Index of the triangle, must be in [0, NumTriangles).